import Container from "components/Container/Container";
import Header from "components/Header";
import MessageList from "components/Message/List/MessageList";
import MessageInput from "components/MessageInput";
import StyledRoom from "./room.style";

const staticItems = [
	{
		time: "08:32",
		source: "owner",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "owner",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "owner",
		content: "سلام",
		author: "شما",
	},
	{
		time: "08:32",
		source: "clinic",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "owner",
		author: "شما",
		content:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
	},
	{
		time: "08:32",
		source: "owner",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "owner",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "clinic",
		content: "لورم ایپسوم متن ساختگی با تولید ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "owner",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "owner",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "clinic",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "clinic",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "clinic",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "clinic",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "clinic",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "clinic",
		content:
			"لورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگی  لورم ایپسوم متن ساختگی با تولید سادگیلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "clinic",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
	{
		time: "08:32",
		source: "clinic",
		content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
		author: "شما",
	},
];

const Room = () => {
	return (
		<StyledRoom>
			<Container>
				<Header />
				<MessageList items={staticItems} />
				<div style={{ backgroundColor: "red", width: "100%" }}></div>
				<MessageInput />
			</Container>
		</StyledRoom>
	);
};

export default Room;
